app/views/users/index.html.erb

<table cellspacing="0">
<% User.find_each do |user| %>
---
SELECT  "users".* FROM "users"   ORDER BY "users"."id" ASC LIMIT 1000