app/views/photos/index.html.erb


	<h1 id="who"class="center jumbotron"><%=User.find(params[:id]).first_name%>'s photos </h1>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

		<table cellspacing="0" class="table table-bordered">
			<% User.find(params[:id]).photos.find_each do |photo| %>
---
SELECT  "photos".* FROM "photos"  WHERE "photos"."user_id" = ?  ORDER BY "photos"."id" ASC LIMIT 1000  [["user_id", 1]]

			    	<p><a href='/comments/new/<%= photo.id %>'>New Comment</a></p>
			    	<%=photo.comments.find_each do |comment| %>
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."photo_id" = ?  ORDER BY "comments"."id" ASC LIMIT 1000  [["photo_id", 2]]