app/controllers/comments_controller.rb

  def new
  	if session[:id]
          @title = "Add new Comment"
          @photo = Photo.find_by_id(params[:id])
---
SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = 2 LIMIT 1

  def create
      comment = Comment.new(:comment => params[:comment][:comment], :photo_id => params[:id], :user_id => params[:comment][:user_id],:date_time => Time.now)
      if comment.save
---
INSERT INTO "comments" ("comment", "created_at", "date_time", "photo_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)