app/controllers/photos_controller.rb

  def create
      new_photo = Photo.new(:user_id => params[:photo][:user_id], :date_time => Time.now, :file_name => params[:photo][:file_name].original_filename)
      name = new_photo.file_name
      directory = "app/assets/images/"
      path = File.join(directory, name)
      File.open(path, "wb") { |f| f.write(params[:photo][:file_name].read) }
      flash[:notice] = "Photo upload successful!"
      if new_photo.save
---
INSERT INTO "photos" ("created_at", "date_time", "file_name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-02-28 07:09:54.923950"], ["date_time", "2015-02-28 07:09:54.919561"], ["file_name", "9.jpg"], ["updated_at", "2015-02-28 07:09:54.923950"], ["user_id", "7"]]