app/controllers/users_controller.rb

  def post_login
  	user = User.find_by_login(params[:user][:login])
---
SELECT  "users".* FROM "users"  WHERE "users"."login" = 'obama' LIMIT 1

  def create
    @user = User.new(user_params)
    if @user.save then
---
INSERT INTO "users" ("created_at", "first_name", "last_name", "login", "password_digest", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)